import fs from 'fs';
import db from '../db.js';

const result = await db.getProperNouns(10);
const text = result.map((x) => `${x.lemma}\t${x.freq}\t${x.qty}`).join('\n');
fs.writeFileSync('./data/propn.txt', text);

// Мінск 321
// Беларусь 294
// Вільня 239
// Германія 179
// Масква 171
// Польшча 166
// Курганішча 143 (назва хутара Крушынскага)
// Расія 138
// Нёман 116
// Амерыка 114
// Менск 106
// Палессе 95
// Дразды 75
// Варшава 72
// Днепр 53
// Еўропа 53
// Сібір 46
// Нясвіж 44
// Нямеччына 42
// Пецярбург 40 + 21
// Пінск 39
// Дняпра 35
// Кіеў 32
// Украіна 32
// Расея 32
// Смаленск 31
// Брэст 30
// Слуцк 30
// Гвінея 28
// Інданезія 28
// Галандыя 28
// Гомель 24
// Англія 24
// Петрыкаў 21
// Парыж 20
// Баранавічы 17
// Літва 17
// Урал 16
// Віцебск 15
// Індыя 15
// Берлін 15
// Дон 15
// Полацк 14
// Эўропа 14
// Гродзеншчына 13
// Панямонь 13
// Ленінград 12
// Сураж 11
// Аўстралія 11
// Лондан 11
// Магілёўшчына 10
// Віленшчына 10
// Барысаў 10
// Клецк 10
// Італія 10
// Крым 10
// Петраград 9

process.exit();
